stm32-rs/stm32f4xx-hal/src/serial.rs
impl PinTx<USART6> for NoTx {}

impl PinRx<USART6> for NoRx {}
#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinTx<USART6> for gpioa::PA11<Alternate<8>> {}
#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinRx<USART6> for gpioa::PA12<Alternate<8>> {}

impl PinTx<USART6> for gpioc::PC6<Alternate<8>> {}

impl PinRx<USART6> for gpioc::PC7<Alternate<8>> {}
#[cfg(any(
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinTx<USART6> for gpiog::PG14<Alternate<8>> {}
#[cfg(any(
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinRx<USART6> for gpiog::PG9<Alternate<8>> {}

#[cfg(feature = "uart7")]
impl PinTx<UART7> for NoTx {}
#[cfg(feature = "uart7")]
impl PinRx<UART7> for NoRx {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinTx<UART7> for gpioa::PA15<Alternate<8>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinRx<UART7> for gpioa::PA8<Alternate<8>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinTx<UART7> for gpiob::PB4<Alternate<8>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinRx<UART7> for gpiob::PB3<Alternate<8>> {}
#[cfg(all(feature = "uart7", feature = "gpioe"))]
impl PinTx<UART7> for gpioe::PE8<Alternate<8>> {}
#[cfg(all(feature = "uart7", feature = "gpioe"))]
impl PinRx<UART7> for gpioe::PE7<Alternate<8>> {}
#[cfg(all(feature = "uart7", feature = "gpiof"))]
impl PinTx<UART7> for gpiof::PF7<Alternate<8>> {}
#[cfg(all(feature = "uart7", feature = "gpiof"))]
impl PinRx<UART7> for gpiof::PF6<Alternate<8>> {}

#[cfg(feature = "uart8")]
impl PinTx<UART8> for NoTx {}
#[cfg(feature = "uart8")]
impl PinRx<UART8> for NoRx {}
#[cfg(all(feature = "uart8", feature = "gpioe"))]
impl PinTx<UART8> for gpioe::PE1<Alternate<8>> {}
#[cfg(all(feature = "uart8", feature = "gpioe"))]
impl PinRx<UART8> for gpioe::PE0<Alternate<8>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinTx<UART8> for gpiof::PF9<Alternate<8>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinRx<UART8> for gpiof::PF8<Alternate<8>> {}

#[cfg(feature = "uart9")]
impl PinTx<UART9> for NoTx {}
#[cfg(feature = "uart9")]
impl PinRx<UART9> for NoRx {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinTx<UART9> for gpiod::PD15<Alternate<11>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinRx<UART9> for gpiod::PD14<Alternate<11>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinTx<UART9> for gpiog::PG1<Alternate<11>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinRx<UART9> for gpiog::PG0<Alternate<11>> {}

#[cfg(feature = "uart10")]
impl PinTx<UART10> for NoTx {}
#[cfg(feature = "uart10")]
impl PinRx<UART10> for NoRx {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinTx<UART10> for gpioe::PE3<Alternate<11>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinRx<UART10> for gpioe::PE2<Alternate<11>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinTx<UART10> for gpiog::PG12<Alternate<11>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinRx<UART10> for gpiog::PG11<Alternate<11>> {}

/// Serial abstraction
pub struct Serial<USART, PINS, WORD = u8> {
    usart: USART,
    pins: PINS,
    _word: PhantomData<WORD>,
}

/// Serial receiver
pub struct Rx<USART, WORD = u8> {
    _usart: PhantomData<USART>,
    _word: PhantomData<WORD>,
}

/// Serial transmitter
pub struct Tx<USART, WORD = u8> {
    _usart: PhantomData<USART>,
    _word: PhantomData<WORD>,
}

impl<
        USART,
        TX_M,
        RX_M,
        WORD,
        const TX_P: char,
        const TX_N: u8,
        const RX_P: char,
        const RX_N: u8,
    > Serial<USART, (PX<TX_M, TX_P, TX_N>, PX<RX_M, RX_P, RX_N>), WORD>
where
    PX<TX_M, TX_P, TX_N>: PinTx<USART>,
    PX<RX_M, RX_P, RX_N>: PinRx<USART>,
    USART: Instance,
{
    /*
        StopBits::STOP0P5 and StopBits::STOP1P5 aren't supported when using UART

        STOP_A::STOP1 and STOP_A::STOP2 will be used, respectively
    */
    pub fn new<TX_BASEM, RX_BASEM>(
        usart: USART,
        pins: (PX<TX_BASEM, TX_P, TX_N>, PX<RX_BASEM, RX_P, RX_N>),
        config: config::Config,
        clocks: Clocks,
    ) -> Result<Self, config::InvalidConfig>
    where
        PX<TX_BASEM, TX_P, TX_N>: Into<PX<TX_M, TX_P, TX_N>>,
        PX<RX_BASEM, RX_P, RX_N>: Into<PX<RX_M, RX_P, RX_N>>,
    {
        use self::config::*;

        unsafe {
            // NOTE(unsafe) this reference will only be used for atomic writes with no side effects.
            let rcc = &(*RCC::ptr());

            // Enable clock.
            USART::enable_clock(rcc);
        }

        let pclk_freq = USART::pclk_freq(&clocks);
        let baud = config.baudrate.0;

        // The frequency to calculate USARTDIV is this:
        //
        // (Taken from STM32F411xC/E Reference Manual,
        // Section 19.3.4, Equation 1)
        //
        // 16 bit oversample: OVER8 = 0
        // 8 bit oversample:  OVER8 = 1
        //
        // USARTDIV =          (pclk)
        //            ------------------------
        //            8 x (2 - OVER8) x (baud)
        //
        // BUT, the USARTDIV has 4 "fractional" bits, which effectively
        // means that we need to "correct" the equation as follows:
        //
        // USARTDIV =      (pclk) * 16
        //            ------------------------
        //            8 x (2 - OVER8) x (baud)
        //
        // When OVER8 is enabled, we can only use the lowest three
        // fractional bits, so we'll need to shift those last four bits
        // right one bit

        // Calculate correct baudrate divisor on the fly
        let (over8, div) = if (pclk_freq / 16) >= baud {
            // We have the ability to oversample to 16 bits, take
            // advantage of it.
            //
            // We also add `baud / 2` to the `pclk_freq` to ensure
            // rounding of values to the closest scale, rather than the
            // floored behavior of normal integer division.
            let div = (pclk_freq + (baud / 2)) / baud;
            (false, div)
        } else if (pclk_freq / 8) >= baud {
            // We are close enough to pclk where we can only
            // oversample 8.
            //
            // See note above regarding `baud` and rounding.
            let div = ((pclk_freq * 2) + (baud / 2)) / baud;

            // Ensure the the fractional bits (only 3) are
            // right-aligned.
            let frac = div & 0xF;
            let div = (div & !0xF) | (frac >> 1);
            (true, div)
        } else {
            return Err(config::InvalidConfig);
        };

        unsafe { (*USART::ptr()).brr.write(|w| w.bits(div)) };

        // Reset other registers to disable advanced USART features
        unsafe { (*USART::ptr()).cr2.reset() };
        unsafe { (*USART::ptr()).cr3.reset() };

